Repository: Exception-Handlers/MediPal
Catalog: lib/l10n/app_*.arb
Languages: zu

source: Home
zu: Ekhaya

source: Work
zu: Umsebenzi

source: Mobile
zu: Iselula

source: Patients
zu: Abaphathi

# addPatient
source: +Patient
zu: Faka Iphathikhi

source: Schedule
zu: Isikhathi

source: Chat
zu: I-Chat

source: Settings
zu: Izilungiselelo

source: Preferences
zu: Ukukhetha

source: Account
zu: I-akhawunti

source: Email, Password Change
zu: I-imeyili, Ukushintshwa Kwe-Password

source: Security
zu: Isimo

source: Privacy Settings for Patient Data Access
zu: Izilungiselelo Ze-Privacy Ngokwenza Ikusasa Lomphathi

source: Notifications
zu: Izaziso

source: Logout
zu: Phuma

source: Patient List
zu: Inqubomgomo Yomphathi

source: All Practitioners List
zu: Inqubomgomo Yabaphathi Bonke

source: All Patients
zu: Bonke Abaphathi

source: All Patients List
zu: Inqubomgomo Yabaphathi Bonke

source: Search
zu: Shicilela

source: Update
zu: Susa Ngokushesha

source: Alerts
zu: Izaziso

source: Appointments
zu: Izicelo

source: My Patients
zu: Abaphathi Bam

source: My Patient List
zu: Inqubomgomo Yamaphathi Am

source: Submit
zu: Yenza

# upload
source: Uploading...
zu: Ukuthwala...

source: Upload of
zu: Ukuthwala kwe

source: successful!
zu: okumangalisayo!

# fixErrorsBeforeProceeding
source: Please fix errors before proceeding
zu: Nceda khombisa izilungiselelo ngaphambi kokuphendula

source: failed!
zu: kufelile!

source: Upload Complete
zu: Ukuthwala Kubungakanani

source: Upload Successful!
zu: Ukuthwala Kwakhiwe Okwenzekile!

source: Upload Failed!
zu: Ukuthwala Kufelile!

source: Search by name...
zu: Shicilela ngokuthi igama...

# nameLabel
source: Name:
zu: Igama:

# dobLabel
source: DOB:
zu: IDB:

source: Family Information
zu: Ulwazi Lwamakhelwane

# patientIdLabel
source: Patient ID:
zu: ID ye-Patient:

source: Patient Record
zu: Inqubomgomo Yomphathi

source: Required
zu: Kuyadingeka

# practitionerChat
source: Practitioners
zu: Abaphathi

source: Forgot Password?
zu: Ukhangisa I-Password?

source: Enter your email
zu: Faka i-imeyili yakho

source: Confirm
zu: Qinisekisa

source: Login successful!
zu: Ukungena kwakhiwe!

# userNotFoundLabel
source: user-not-found
zu: umsebenzisi-ayikutholakali

# userNotFound
source: No user found for that email.
zu: Akukho umsebenzisi ozithandayo ngalolunye u-imeyili.

# wrongPasswordLabel
source: wrong-password
zu: i-Password engalungile

# wrongPassword
source: Wrong password provided for that user.
zu: I-Password engalungile enikezelwe kulesi sikhathi.

# errorOccurred
source: An error occurred.
zu: Kulungilekwaze kwakhiye.

source: Patient Form
zu: I-Form ye-Patient

# errorLabel
source: Error:
zu: Isiphithiphithi:

# pleaseFixErrors
source: Please fix errors before proceeding
zu: Nceda khombisa izilungiselelo ngaphambi kokuphendula

source: Patient data updated
zu: Ulwazi lwomphathi lukhiqizwe

source: Error updating patient:
zu: Isiphithiphithi ngesisekelo somphathi:

source: Patient data added
zu: Ulwazi lwomphathi luphambiliwe

source: Error adding patient
zu: Isiphithiphithi ngokuqala omphathi

source: Back
zu: Emuva

source: Next
zu: Okulandelayo

source: Patient list updated
zu: Inqubomgomo Yamaphathi Yakuqashiwe

source: Error updating patient list:
zu: Isiphithiphithi ngokuqashiwa komphathi:

source: DOB:
zu: IDB:

source: Language
zu: Ulimi

source: Region
zu: Isifunda

source: Welcome
zu: Wamukelekile

source: Password
zu: I-Password

source: Login
zu: Ukungena

source: Name
zu: Igama

source: First Name
zu: Igama Lokugcina

source: Middle Name
zu: Igama Lokumiddle

source: Blood Group
zu: Umbobo Wezingqadi

source: Sex
zu: Isifungo

source: Add More
zu: Engeza Okunye

source: No Appointments Found
zu: Ayikutholakali Izicelo

source: Appointment List
zu: Inqubomgomo Yezicelo

source: Appointment list updated
zu: Inqubomgomo Yezicelo Igqwashelwe

source: Appointment added for
zu: Izicelo zihambelana nomphathi

source: at
zu: ngo

source: Date Selected:
zu: Idethi ekhethiwe:

source: Error updating appointment list
zu: Isiphithiphithi ngesisekelo se-Appointment

source: Upcoming Appointments
zu: Izicelo Ezayo

source: Last Name
zu: Igama Leliya

source: Email
zu: I-imeyili

source: Phone Number
zu: Inombolo Yefowuni

source: License Number
zu: Inombolo yelisensi

source: Country
zu: Izwe

source: Create Account
zu: Yenza I-akhawunti

source: Create Appointment
zu: Yenza Izicelo

# termsAndServices
source: By clicking “Create Account” you accept our Terms and Services agreement.
zu: Ngokucaphuna “Yenza I-akhawunti” unqumele ukubaluleka kwethu kwi-Terms and Services.

source: Email or phone
zu: I-imeyili noma ifowuni

source: Don't have an account?
zu: Awunayo i-akhawunti?

source: Sign Up
zu: Cela

source: Date of Birth
zu: Idethi Yokuzalwa

source: Location
zu: Indawo

source: Blood type
zu: Uhlobo Lwezingqadi

source: Marital status
zu: Isimo Sombuso

source: married
zu: kuyingane

source: Contact Information
zu: Ulwazi Lolunxulumano

source: General Information
zu: Ulwazi Lwamahhala

source: Phone
zu: I-fowuni

source: idImage
zu: Inombolo ye-ID

source: Select DOB
zu: Khetha IDB

source: Select Image
zu: Khetha Inqaku

source: Select ID Image
zu: Khetha ID Image

source: Select a Time:
zu: Khetha Isikhathi:

source: Time
zu: Isikhathi

source: Select a Patient
zu: Khetha Umphathi

source: Topic
zu: Isiqubulo

source: No Times Available For This Day
zu: Ayikutholakali Izikhathi Ngalelo Dethi

source: Image Display
zu: Ukuqubuka Kwesithombe

source: RH Factor
zu: I-RH Factor

source: Error Showing Image
zu: Isiphithiphithi Sokukhombisa Isithombe

# selectPhoneType
source: Please Select Phone Type
zu: Nceda Khetha Uhlobo Lokufowuna

source: Emergency Contact
zu: Inxulumano Yokulahlekelwa

source: Emergency Contact Information
zu: Ulwazi Lokuxhumana Ekupheleni

source: Health Conditions
zu: Imithamo Yezempilo

source: Illness
zu: Ukwehlukana

source: Current Illness
zu: Ukwehlukana Okwenza

source: Previous Illness
zu: Ukwehlukana Okwesibili

source: Allergies
zu: Izinto Ezikwelashwa

source: Cancel
zu: Khansela

source: Specific Allergies
zu: Izinto Ezikwelashwa Ezahlukahlukene

source: Medications
zu: Izidakamizwa

source: Current Medications
zu: Izidakamizwa Ezikhona

source: Previous Medications
zu: Izidakamizwa Ezehlukene

source: File Path
zu: Indlela Yefayela

source: File
zu: Ifayela

source: added successfully.
zu: kusungulwa ngokusebenzisa okuphelele.

source: Allergy
zu: Izinto Ezikwelashwa

source: medication
zu: Izidakamizwa

source: Remaining Patients
zu: Abaphathi Abaphile

source: Account Information
zu: Ulwazi Lwase-akhawunti

source: Reset Password
zu: Ngena Kabusha I-Password

source: Profile Photo
zu: I-Foto ye-Profile

source: Error Uploading Image
zu: Isiphithiphithi Sokuthwala Isithombe

source: Reauthenticated
zu: Isikhuthazwe Kabusha

source: Failed to reauthenticate
zu: Kufelile ukuthuthukiswa kabusha

source: Changes saved
zu: Izilungiselelo Zaqashelwa

source: Failed to save changes to database
zu: Kufelile ukushicilela izilungiselelo ekwindini

# passwordResetEmailSent
source: Passwprd reset email sent to
zu: I-imeyili yekuthuthukiswa kabusha kwephasiwedi

# failedToSendPass
source: Failed to send password reset email
zu: Kufelile ukuthuma i-imeyili yokuthuthukiswa kwe-password

# pleaseEnterEmail
source: Please enter your email
zu: Nceda ufake i-imeyili yakho

source: Practitioner List
zu: Inqubomgomo Yabaphathi

source: Please select a patient
zu: Nceda khetha umphathi

source: Time Selected
zu: Isikhathi ekhethiwe

source: Reason for Appointment
zu: Indlela Yokwenza Izicelo

source: File deleted successfully
zu: Ifayela litholakala okusungulwa

source: Error deleting files
zu: Isiphithiphithi ngesisekelo sokususa amafayela

source: File Name
zu: Igama le-File

source: Add Files
zu: Engeza Imifayela
